t = int(input("Введите количество билетов: "))
q = t
c = 0

while q !=0:
    age = int(input(f'Введите возраст посетителя {q}: '))
    if 0 > age or age > 100:
        raise ValueError("Введено некорректное значение возраста!!!")
    elif 0 <= age < 18:
        print ("Билет бесплатный")
    elif 18 <= age < 25:
        c+=990
        print("Цена билета равна: 990 рублей")
    else:
        c+=1390
        print("Цена билета равна: 1390 рублей")
    q-= 1
if t > 3:
    S = 0.9*c
    print("----------------------")
    print(f'Сумма к оплате: {S} рублей, скидка составила 10%')
else:
    print("----------------------")
    print(f'Сумма к оплате: {c} рублей')
